from PIL import Image


font = Image.open("font2.png")
paper = Image.open('img.png')

word = 'анна_и_дина'
word = 'владимир_юрьевич'
word = 'лариса_ивановна'
word = 'лева_кондратьев'

letters = {
    '_': (0, 0, 30, 283),
    'а': (65, 0, 138, 283),
    'б': (135, 0, 208, 283),
    'в': (242, 0, 295, 283),
    'г': (310, 0, 385, 283),
    'д': (388, 0, 485, 283),
    'е': (500, 0, 560, 283),
    'e': (575, 0, 632, 283),
    'ж': (650, 0, 743, 283),
    'з': (760, 0, 832, 283),
    'и': (850, 0, 923, 283),
    'й': (100, 0, 100, 100),
    'к': (1028, 0, 1105, 283),
    'л': (1129, 0, 1202, 283),
    'м': (1215, 0, 1308, 283),
    'н': (1325, 0, 1391, 283),
    'о': (1415, 0, 1483, 283),
    'п': (1505, 0, 1575, 283),
    'р': (1595, 0, 1656, 283),
    'с': (1662, 0, 1736, 283),
    'т': (1759, 0, 1855, 283),
    'у': (1871, 0, 1948, 283),
    'ф': (1985, 0, 2087, 283),
    'х': (2118, 0, 2198, 283),
    'ц': (2232, 0, 2313, 283),
    'ч': (2342, 0, 2402, 283),
    'ш': (2427, 0, 2542, 283),
    'щ': (2554, 0, 2678, 283),
    'ъ': (2704, 0, 2785, 283),
    'ы': (2809, 0, 2889, 283),
    'ь': (2923, 0, 2976, 283),
    'э': (3000, 0, 3087, 283),
    'ю': (3107, 0, 3204, 283),
    'я': (3217, 0, 3285, 283),
}


# word = ''.join(letters.keys())

word_w = 0
letter_imgs = []

for char in word:
    letter = letters[char]
    # letter = list(letter)
    # letter[2]
    # letter = tuple(letter)
    img = font.crop(letter)
    w = letter[2] - letter[0] + 10
    word_w += w
    letter_imgs.append((img, w))

# crop_rectangle = (0, 10, 10, 10)
name = Image.new('RGBA', (word_w, 283), (255, 0, 0, 0))
img_w = 0
for img, w in letter_imgs:
    name.paste(img, (img_w, 0))
    img_w += w

width, height = name.size
name.thumbnail((width // 1.5, height // 1.5), Image.ANTIALIAS)

paper.paste(name, (490, 260), name)
paper.show()

# name.show()
